#+TITLE:Day 1: Calorie Counting

https://adventofcode.com/2022/day/1

* Part 1

** Problem

The Elves take turns writing down the number of Calories contained by
the various meals, snacks, rations, etc. that they've brought with
them, one item per line. Each Elf separates their own inventory from
the previous Elf's inventory (if any) by a blank line.

For example, suppose the Elves finish writing their items' Calories
and end up with the following list:

#+begin_src text
  1000
  2000
  3000

  4000

  5000
  6000

  7000
  8000
  9000

  10000
#+end_src

This list represents the Calories of the food carried by five Elves:

- The first Elf is carrying food with 1000, 2000, and 3000 Calories, a
  total of 6000 Calories.

- The second Elf is carrying one food item with 4000 Calories.

- The third Elf is carrying food with 5000 and 6000 Calories, a total
  of 11000 Calories.

- The fourth Elf is carrying food with 7000, 8000, and 9000 Calories,
  a total of 24000 Calories.

- The fifth Elf is carrying one food item with 10000 Calories.

In case the Elves get hungry and need extra snacks, they need to know
which Elf to ask: they'd like to know how many Calories are being
carried by the Elf carrying the most Calories. In the example above,
this is 24000 (carried by the fourth Elf).

Find the Elf carrying the most Calories. *How many total Calories is
that Elf carrying?*


** Solution (C++)

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++20 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <string>
  using namespace std;

  int findMaxCalories(const string& filename) {
      ifstream file(filename);
      string line;
      int calorieSum = 0;
      int maxCalories = 0;

      while (getline(file, line)) {
          cout << "Line: '" << line << "'\n";

          if (!line.empty()) {
              calorieSum += stoi(line);
              maxCalories = max(maxCalories, calorieSum);
          }
          else {
              // Empty line. We have finished all the calorie
              // information for an elf.
              calorieSum = 0;     // Reset for next elf
          }
      }

      file.close();

      return maxCalories;
  }

  int main() {
      cout << findMaxCalories("input.txt") << "\n";
  }
#+end_src

#+RESULTS:
#+begin_example
Line: '3264'
Line: '4043'
Line: '2537'
Line: '3319'
Line: '2485'
Line: '3218'
Line: '5611'
Line: '1753'
Line: '7232'
Line: '3265'
Line: '1751'
Line: '2233'
Line: ''
Line: '10589'
Line: '5121'
Line: '11465'
Line: '9307'
Line: '1347'
Line: '9392'
Line: '12037'
Line: ''
Line: '6025'
Line: '4328'
Line: '3982'
Line: '4487'
Line: '1139'
Line: '1440'
Line: '2970'
Line: '3390'
Line: '1844'
Line: '5400'
Line: '1651'
Line: '4109'
Line: '3584'
Line: '2926'
Line: '4297'
Line: ''
Line: '8921'
Line: '13298'
Line: '12300'
Line: '5607'
Line: '3304'
Line: '5037'
Line: ''
Line: '1729'
Line: '10057'
Line: ''
Line: '3538'
Line: '3984'
Line: '3451'
Line: '5638'
Line: '2880'
Line: '1008'
Line: '2940'
Line: '6245'
Line: '3865'
Line: '5060'
Line: '2878'
Line: '2460'
Line: '6557'
Line: ''
Line: '1584'
Line: '6391'
Line: '3479'
Line: '2264'
Line: '2683'
Line: '3680'
Line: '1183'
Line: '5121'
Line: '6499'
Line: '5543'
Line: '1192'
Line: '4818'
Line: ''
Line: '1337'
Line: '8128'
Line: '8966'
Line: '7601'
Line: '7749'
Line: '5017'
Line: '3251'
Line: '1074'
Line: '6095'
Line: ''
Line: '11824'
Line: '17144'
Line: '5396'
Line: '15416'
Line: ''
Line: '6244'
Line: '6589'
Line: '4953'
Line: '4250'
Line: '1422'
Line: '1252'
Line: '4555'
Line: '5240'
Line: '4244'
Line: '4088'
Line: ''
Line: '27353'
Line: ''
Line: '6629'
Line: '7231'
Line: '7673'
Line: '7029'
Line: '6994'
Line: '6347'
Line: '6381'
Line: '1503'
Line: '2145'
Line: '1114'
Line: '6068'
Line: ''
Line: '3473'
Line: '3935'
Line: '4054'
Line: '3558'
Line: '3818'
Line: '5370'
Line: '4807'
Line: '2703'
Line: '5407'
Line: '2532'
Line: '6833'
Line: '1675'
Line: ''
Line: '20016'
Line: '7587'
Line: '13088'
Line: ''
Line: '3477'
Line: '3118'
Line: '5815'
Line: '3551'
Line: '2316'
Line: '4254'
Line: '4814'
Line: '5726'
Line: '5324'
Line: '6096'
Line: '3596'
Line: '3374'
Line: '3975'
Line: '4152'
Line: '1946'
Line: ''
Line: '4549'
Line: '3639'
Line: '6338'
Line: '6882'
Line: '3514'
Line: '6488'
Line: '2192'
Line: '4522'
Line: '4370'
Line: '3637'
Line: '3500'
Line: '2964'
Line: '1850'
Line: ''
Line: '6900'
Line: '5145'
Line: '13864'
Line: '8145'
Line: '4579'
Line: ''
Line: '1984'
Line: '1589'
Line: '9279'
Line: '10987'
Line: '5213'
Line: ''
Line: '3997'
Line: '1978'
Line: '5061'
Line: '2710'
Line: '2695'
Line: '4713'
Line: '5930'
Line: '3005'
Line: '6189'
Line: '2619'
Line: '6897'
Line: '5032'
Line: '2374'
Line: ''
Line: '1738'
Line: '6817'
Line: '1993'
Line: '13747'
Line: '8574'
Line: '13341'
Line: ''
Line: '3869'
Line: '1810'
Line: '3501'
Line: '1366'
Line: '4240'
Line: '2005'
Line: '6102'
Line: '6069'
Line: '4135'
Line: '6667'
Line: '1239'
Line: '2799'
Line: '1900'
Line: ''
Line: '4711'
Line: '1330'
Line: '9725'
Line: '5965'
Line: '8271'
Line: '11932'
Line: ''
Line: '5319'
Line: '6078'
Line: '1652'
Line: '1958'
Line: '1992'
Line: '1997'
Line: '2824'
Line: '6542'
Line: '1998'
Line: '2713'
Line: '6806'
Line: '4993'
Line: '6569'
Line: ''
Line: '9262'
Line: ''
Line: '3814'
Line: '11917'
Line: '4812'
Line: '1884'
Line: '3686'
Line: '10993'
Line: ''
Line: '8845'
Line: '6032'
Line: '9899'
Line: '10384'
Line: '3834'
Line: '2275'
Line: ''
Line: '3559'
Line: '2268'
Line: '1446'
Line: ''
Line: '2265'
Line: '5503'
Line: '5056'
Line: '2547'
Line: '7394'
Line: '2514'
Line: '8105'
Line: '4630'
Line: '9392'
Line: ''
Line: '2377'
Line: '10479'
Line: '3452'
Line: '9175'
Line: '13773'
Line: ''
Line: '6090'
Line: '1467'
Line: '2747'
Line: '9310'
Line: '2839'
Line: '9392'
Line: '10752'
Line: '5771'
Line: ''
Line: '8193'
Line: '4139'
Line: '4728'
Line: '5180'
Line: '5884'
Line: '9236'
Line: ''
Line: '5721'
Line: '10884'
Line: '10268'
Line: '3255'
Line: '2377'
Line: '11574'
Line: '4498'
Line: ''
Line: '17228'
Line: '7306'
Line: '6465'
Line: ''
Line: '69149'
Line: ''
Line: '6323'
Line: '3435'
Line: '2801'
Line: '6385'
Line: '4192'
Line: '1593'
Line: '4373'
Line: '6654'
Line: '7190'
Line: '6142'
Line: ''
Line: '10960'
Line: '3399'
Line: '12251'
Line: '8249'
Line: '8210'
Line: '3571'
Line: ''
Line: '2299'
Line: '4349'
Line: '1476'
Line: '5703'
Line: '1497'
Line: '4008'
Line: '1435'
Line: '5043'
Line: '2203'
Line: '4252'
Line: '2407'
Line: '5891'
Line: ''
Line: '1419'
Line: '1588'
Line: ''
Line: '4266'
Line: '2424'
Line: '1846'
Line: '3265'
Line: '5720'
Line: '5396'
Line: '2013'
Line: '2664'
Line: '4712'
Line: '1040'
Line: '3186'
Line: '1693'
Line: '1537'
Line: '3226'
Line: ''
Line: '15568'
Line: '16153'
Line: '15408'
Line: '9417'
Line: '15524'
Line: ''
Line: '18017'
Line: '4247'
Line: '1764'
Line: '18920'
Line: ''
Line: '14176'
Line: '18583'
Line: ''
Line: '4896'
Line: '1029'
Line: '14517'
Line: '10183'
Line: '9726'
Line: ''
Line: '5242'
Line: '4156'
Line: '2314'
Line: '4018'
Line: '3542'
Line: '1619'
Line: '5349'
Line: '2524'
Line: '2620'
Line: '4675'
Line: '6491'
Line: '5315'
Line: '3959'
Line: '5215'
Line: ''
Line: '2638'
Line: '5346'
Line: '6209'
Line: '1466'
Line: '2854'
Line: '6677'
Line: '2242'
Line: '8476'
Line: '5236'
Line: ''
Line: '3827'
Line: '4489'
Line: '7735'
Line: '5656'
Line: '11568'
Line: '12323'
Line: ''
Line: '8560'
Line: '7046'
Line: '5453'
Line: '4141'
Line: '1356'
Line: '8940'
Line: '8338'
Line: '3749'
Line: '7297'
Line: ''
Line: '10693'
Line: '7191'
Line: '8803'
Line: '10504'
Line: '2033'
Line: '6374'
Line: '6820'
Line: '10316'
Line: ''
Line: '5869'
Line: '12102'
Line: '12675'
Line: '7688'
Line: '10906'
Line: '12593'
Line: ''
Line: '9028'
Line: '8234'
Line: '4453'
Line: '2117'
Line: '7328'
Line: '9404'
Line: '6664'
Line: '7206'
Line: '6357'
Line: ''
Line: '3018'
Line: '5515'
Line: '6479'
Line: '1522'
Line: '4582'
Line: '5881'
Line: '4019'
Line: '1288'
Line: '5288'
Line: '4007'
Line: '5816'
Line: '2354'
Line: '5648'
Line: '5405'
Line: ''
Line: '4120'
Line: '3890'
Line: '11718'
Line: '5713'
Line: '6986'
Line: '10362'
Line: '5529'
Line: ''
Line: '8243'
Line: '2097'
Line: '10194'
Line: '3023'
Line: '11120'
Line: '9524'
Line: '2052'
Line: ''
Line: '12552'
Line: '14406'
Line: '3981'
Line: '9703'
Line: '10329'
Line: ''
Line: '7256'
Line: '9424'
Line: '4701'
Line: ''
Line: '5694'
Line: '1262'
Line: '3521'
Line: '4194'
Line: '3530'
Line: '7472'
Line: '1773'
Line: '1787'
Line: '6229'
Line: '6608'
Line: '5905'
Line: '3065'
Line: ''
Line: '3366'
Line: ''
Line: '15198'
Line: '25328'
Line: ''
Line: '3805'
Line: '4163'
Line: '4192'
Line: '4013'
Line: '2693'
Line: '3029'
Line: '4559'
Line: '5243'
Line: '3088'
Line: '4804'
Line: '1245'
Line: '1800'
Line: '4999'
Line: '3162'
Line: '6114'
Line: ''
Line: '3808'
Line: '3672'
Line: '6397'
Line: '3747'
Line: '4312'
Line: '5015'
Line: '4237'
Line: '5326'
Line: '3961'
Line: '1382'
Line: '1380'
Line: '5517'
Line: '1140'
Line: ''
Line: '3360'
Line: '6936'
Line: '3880'
Line: '4242'
Line: '7431'
Line: '5597'
Line: '6195'
Line: '5305'
Line: '1051'
Line: '1015'
Line: '1866'
Line: '3179'
Line: ''
Line: '17144'
Line: '2423'
Line: '8330'
Line: ''
Line: '5153'
Line: '2301'
Line: '4944'
Line: '1566'
Line: '5647'
Line: '6726'
Line: '6248'
Line: '1537'
Line: '6951'
Line: '1272'
Line: '1177'
Line: '2013'
Line: ''
Line: '7595'
Line: '9953'
Line: '19751'
Line: '14200'
Line: ''
Line: '2576'
Line: '1684'
Line: '6463'
Line: '6643'
Line: '2911'
Line: '1650'
Line: '2492'
Line: '5726'
Line: '4830'
Line: '6591'
Line: '4477'
Line: '6691'
Line: '6390'
Line: ''
Line: '5209'
Line: '5099'
Line: '1115'
Line: '5456'
Line: '4573'
Line: '5954'
Line: '4389'
Line: '1703'
Line: '1595'
Line: '1348'
Line: '5814'
Line: '4031'
Line: '3086'
Line: '4039'
Line: '5445'
Line: ''
Line: '3506'
Line: '3956'
Line: '1504'
Line: '5435'
Line: '5660'
Line: '6882'
Line: '1962'
Line: '4891'
Line: '2596'
Line: '3838'
Line: '7206'
Line: '5554'
Line: ''
Line: '10423'
Line: '4792'
Line: '16000'
Line: '12857'
Line: '5040'
Line: ''
Line: '7410'
Line: '2589'
Line: '6769'
Line: '8168'
Line: '7526'
Line: '4349'
Line: ''
Line: '5160'
Line: '12452'
Line: '13889'
Line: '7499'
Line: '1985'
Line: '12491'
Line: ''
Line: '1033'
Line: '9259'
Line: '6288'
Line: '5566'
Line: '6134'
Line: '11010'
Line: '7512'
Line: ''
Line: '5196'
Line: '4644'
Line: '1825'
Line: '5564'
Line: '5759'
Line: '7134'
Line: '5589'
Line: '5387'
Line: '1328'
Line: '2314'
Line: '4948'
Line: '7354'
Line: ''
Line: '6875'
Line: '2105'
Line: '3444'
Line: '6997'
Line: '3962'
Line: '1141'
Line: '2000'
Line: '7561'
Line: '6447'
Line: '5629'
Line: '7035'
Line: ''
Line: '1499'
Line: '7160'
Line: '5201'
Line: '3206'
Line: '2719'
Line: '5177'
Line: '6566'
Line: '3455'
Line: '3304'
Line: '1648'
Line: '3273'
Line: ''
Line: '6142'
Line: '3697'
Line: '2247'
Line: '6537'
Line: '5579'
Line: '7126'
Line: '2674'
Line: '1842'
Line: '1482'
Line: '5504'
Line: '1105'
Line: ''
Line: '5669'
Line: '7401'
Line: '8229'
Line: '6261'
Line: '4378'
Line: '5548'
Line: '2360'
Line: '5703'
Line: '7650'
Line: '2086'
Line: ''
Line: '23865'
Line: '10240'
Line: '2321'
Line: ''
Line: '4221'
Line: '8067'
Line: '1395'
Line: '1397'
Line: '5776'
Line: '5136'
Line: '6820'
Line: '1428'
Line: '3375'
Line: '6117'
Line: '4467'
Line: ''
Line: '2505'
Line: '4307'
Line: '5626'
Line: '8867'
Line: ''
Line: '4709'
Line: '5951'
Line: '3811'
Line: '4998'
Line: '4460'
Line: '6243'
Line: '1790'
Line: '2172'
Line: '5694'
Line: '6245'
Line: '3273'
Line: '2664'
Line: '4813'
Line: '5669'
Line: ''
Line: '5803'
Line: '4856'
Line: '2508'
Line: '6301'
Line: '4454'
Line: '2430'
Line: '4868'
Line: '4883'
Line: '6211'
Line: '1749'
Line: '2998'
Line: '3450'
Line: '2414'
Line: '5617'
Line: ''
Line: '9135'
Line: '8583'
Line: '7582'
Line: '8349'
Line: '7609'
Line: '4434'
Line: '8362'
Line: '3472'
Line: ''
Line: '44093'
Line: ''
Line: '7933'
Line: '3349'
Line: '6041'
Line: '3238'
Line: '5036'
Line: '9100'
Line: '4252'
Line: ''
Line: '14356'
Line: '24185'
Line: ''
Line: '11887'
Line: '23333'
Line: '16694'
Line: ''
Line: '6324'
Line: '1438'
Line: '5180'
Line: '5329'
Line: '6798'
Line: '4806'
Line: '5285'
Line: '4757'
Line: '4599'
Line: '3897'
Line: '2308'
Line: '5014'
Line: ''
Line: '1455'
Line: '4268'
Line: '1903'
Line: '1436'
Line: '4563'
Line: '5135'
Line: '4876'
Line: '6561'
Line: '4776'
Line: '3530'
Line: '3080'
Line: '5724'
Line: '5520'
Line: ''
Line: '3419'
Line: '2363'
Line: '4474'
Line: '6069'
Line: '2504'
Line: '6749'
Line: '4094'
Line: '5991'
Line: '8045'
Line: '1302'
Line: '5649'
Line: ''
Line: '20607'
Line: '13990'
Line: ''
Line: '7588'
Line: '9960'
Line: '8919'
Line: '11254'
Line: '6295'
Line: '3856'
Line: '10295'
Line: ''
Line: '1161'
Line: '3773'
Line: '1559'
Line: '1198'
Line: '5967'
Line: '5237'
Line: '3369'
Line: '4437'
Line: '7698'
Line: '2756'
Line: '2639'
Line: ''
Line: '43493'
Line: ''
Line: '18577'
Line: '2593'
Line: '16336'
Line: '13785'
Line: ''
Line: '6567'
Line: '2409'
Line: '8001'
Line: '4173'
Line: '11587'
Line: '8238'
Line: '3023'
Line: ''
Line: '5146'
Line: '10077'
Line: '2630'
Line: '4827'
Line: '6199'
Line: '3701'
Line: '3840'
Line: '3068'
Line: ''
Line: '3272'
Line: '5212'
Line: '3674'
Line: '5352'
Line: '3129'
Line: '4242'
Line: '2711'
Line: '3064'
Line: '4987'
Line: '5362'
Line: '4858'
Line: '3180'
Line: '6090'
Line: '2265'
Line: '4791'
Line: ''
Line: '14702'
Line: '1034'
Line: ''
Line: '12170'
Line: '8780'
Line: '14933'
Line: '3727'
Line: ''
Line: '4239'
Line: '7116'
Line: '1120'
Line: '7853'
Line: '7862'
Line: '5512'
Line: '2309'
Line: '3094'
Line: '6359'
Line: ''
Line: '9172'
Line: '12494'
Line: '8382'
Line: ''
Line: '8629'
Line: '11921'
Line: '9629'
Line: '11535'
Line: '7792'
Line: '9996'
Line: ''
Line: '6887'
Line: '10548'
Line: '3429'
Line: '2373'
Line: '6208'
Line: '5406'
Line: '5440'
Line: ''
Line: '2164'
Line: '3233'
Line: '1512'
Line: '1556'
Line: '5476'
Line: '3462'
Line: '4261'
Line: '3563'
Line: '2409'
Line: '6236'
Line: '2568'
Line: '4638'
Line: '4775'
Line: '1131'
Line: ''
Line: '27798'
Line: '30212'
Line: ''
Line: '5409'
Line: '4676'
Line: '5445'
Line: '2119'
Line: '3557'
Line: '1135'
Line: '6724'
Line: '2779'
Line: '1324'
Line: '2157'
Line: '4456'
Line: '6329'
Line: '2155'
Line: ''
Line: '4084'
Line: '1379'
Line: '7443'
Line: '12904'
Line: ''
Line: '7167'
Line: '12163'
Line: '9588'
Line: '11186'
Line: '9015'
Line: ''
Line: '35132'
Line: '18974'
Line: ''
Line: '3418'
Line: ''
Line: '12568'
Line: '1418'
Line: '7691'
Line: '12369'
Line: '1144'
Line: '6141'
Line: ''
Line: '2523'
Line: '5150'
Line: '2276'
Line: '6036'
Line: '1492'
Line: '5069'
Line: '5782'
Line: '2999'
Line: '4505'
Line: '2347'
Line: '1234'
Line: '5376'
Line: '3356'
Line: '2489'
Line: '1456'
Line: ''
Line: '30181'
Line: ''
Line: '3189'
Line: '2572'
Line: '5145'
Line: '4350'
Line: '6403'
Line: '1285'
Line: '5678'
Line: '3796'
Line: '3792'
Line: '2334'
Line: '2710'
Line: '3536'
Line: '5580'
Line: ''
Line: '2991'
Line: '7718'
Line: '1798'
Line: '5300'
Line: '11608'
Line: '3376'
Line: '11658'
Line: ''
Line: '58468'
Line: ''
Line: '6099'
Line: '4433'
Line: '7634'
Line: '7768'
Line: '3804'
Line: '5523'
Line: '6959'
Line: '4752'
Line: '8693'
Line: '2705'
Line: ''
Line: '5315'
Line: '4218'
Line: ''
Line: '5678'
Line: '2293'
Line: '2385'
Line: '2568'
Line: '1644'
Line: '3332'
Line: '5968'
Line: '4159'
Line: '5935'
Line: '2667'
Line: '4518'
Line: '2823'
Line: '4648'
Line: '3072'
Line: '5644'
Line: ''
Line: '14306'
Line: '7557'
Line: '15251'
Line: '6896'
Line: '14250'
Line: ''
Line: '10549'
Line: '1662'
Line: '10040'
Line: '2614'
Line: '4843'
Line: '1111'
Line: '9585'
Line: ''
Line: '9531'
Line: '2249'
Line: '1949'
Line: '8715'
Line: '9466'
Line: '1471'
Line: '7952'
Line: ''
Line: '2585'
Line: '8702'
Line: '10548'
Line: '12849'
Line: '5342'
Line: '10193'
Line: ''
Line: '21463'
Line: '24241'
Line: '9125'
Line: ''
Line: '36676'
Line: ''
Line: '18212'
Line: '11298'
Line: '8690'
Line: ''
Line: '6861'
Line: '1095'
Line: '4586'
Line: '1260'
Line: '2795'
Line: '3208'
Line: '4650'
Line: '4147'
Line: '5764'
Line: '1051'
Line: '6882'
Line: '5670'
Line: ''
Line: '16681'
Line: '22273'
Line: '1336'
Line: ''
Line: '3370'
Line: '3537'
Line: '2062'
Line: '4985'
Line: '2063'
Line: '2339'
Line: '5988'
Line: '3777'
Line: '5822'
Line: '2760'
Line: '1915'
Line: '4668'
Line: '4717'
Line: '5847'
Line: '4598'
Line: ''
Line: '5829'
Line: '4829'
Line: '4872'
Line: '3893'
Line: '5320'
Line: '1832'
Line: '7637'
Line: '7137'
Line: '6079'
Line: '3006'
Line: '7422'
Line: ''
Line: '34780'
Line: '21066'
Line: ''
Line: '1164'
Line: '3444'
Line: '8079'
Line: '4633'
Line: '5030'
Line: '8296'
Line: '8703'
Line: '7929'
Line: '8767'
Line: '4489'
Line: ''
Line: '1950'
Line: '5492'
Line: '4920'
Line: '3849'
Line: '6553'
Line: '1802'
Line: '1574'
Line: '4962'
Line: '1671'
Line: '2382'
Line: '4990'
Line: '2511'
Line: '3485'
Line: ''
Line: '6003'
Line: '8237'
Line: ''
Line: '10793'
Line: '12510'
Line: '2959'
Line: '9397'
Line: '6153'
Line: ''
Line: '7943'
Line: '1934'
Line: '3817'
Line: '7937'
Line: '6856'
Line: '3813'
Line: '4408'
Line: '8046'
Line: '4605'
Line: '3994'
Line: '8081'
Line: ''
Line: '10589'
Line: '11870'
Line: '8367'
Line: '7889'
Line: '10172'
Line: '9758'
Line: '9447'
Line: ''
Line: '6566'
Line: '4971'
Line: '4600'
Line: '6863'
Line: '4212'
Line: '5240'
Line: '6523'
Line: '7979'
Line: '2695'
Line: '4934'
Line: ''
Line: '6527'
Line: '2008'
Line: '4595'
Line: '7104'
Line: '7497'
Line: '10199'
Line: '6640'
Line: '7909'
Line: ''
Line: '7970'
Line: '7026'
Line: '4812'
Line: '4331'
Line: '3244'
Line: '5260'
Line: '3089'
Line: '2871'
Line: '3915'
Line: '1445'
Line: ''
Line: '3182'
Line: '9915'
Line: '5769'
Line: '6470'
Line: '10524'
Line: '7486'
Line: '5041'
Line: ''
Line: '5575'
Line: ''
Line: '6482'
Line: '2235'
Line: '2834'
Line: '3999'
Line: '4428'
Line: '1713'
Line: '3366'
Line: '4477'
Line: '2282'
Line: '1331'
Line: '5095'
Line: '5268'
Line: '5482'
Line: '3409'
Line: ''
Line: '21109'
Line: ''
Line: '8502'
Line: '2007'
Line: '3250'
Line: '6035'
Line: '6099'
Line: '2605'
Line: '6323'
Line: '5532'
Line: '3677'
Line: '8194'
Line: ''
Line: '11224'
Line: '1704'
Line: '10152'
Line: '11640'
Line: '1018'
Line: '7016'
Line: '2700'
Line: ''
Line: '12204'
Line: ''
Line: '1191'
Line: '5039'
Line: '5036'
Line: '3778'
Line: '1669'
Line: '5277'
Line: '5345'
Line: '3833'
Line: '5379'
Line: '1286'
Line: '2042'
Line: '5365'
Line: '4518'
Line: '5517'
Line: ''
Line: '2750'
Line: '4544'
Line: '3817'
Line: '5392'
Line: '1745'
Line: '4056'
Line: '1557'
Line: '1819'
Line: '6187'
Line: '4867'
Line: '6445'
Line: '4475'
Line: '3026'
Line: '5516'
Line: ''
Line: '13176'
Line: '25505'
Line: '2657'
Line: ''
Line: '29617'
Line: '4098'
Line: ''
Line: '1733'
Line: '3055'
Line: '3730'
Line: '5327'
Line: '3111'
Line: '4912'
Line: '1842'
Line: '2471'
Line: '1964'
Line: '2747'
Line: '1573'
Line: '4097'
Line: '5558'
Line: '4940'
Line: '2065'
Line: ''
Line: '1177'
Line: '3510'
Line: '6178'
Line: '1267'
Line: '9395'
Line: '1387'
Line: '1251'
Line: '9112'
Line: '1265'
Line: ''
Line: '4073'
Line: '8822'
Line: ''
Line: '5585'
Line: '4905'
Line: '1005'
Line: '4303'
Line: '2129'
Line: '1565'
Line: '1577'
Line: '1747'
Line: '7097'
Line: '7135'
Line: '2546'
Line: ''
Line: '6368'
Line: '6384'
Line: '1873'
Line: '2027'
Line: '2111'
Line: '5781'
Line: '4392'
Line: '1640'
Line: '1874'
Line: '5147'
Line: '6551'
Line: '4992'
Line: ''
Line: '11673'
Line: '15872'
Line: '10747'
Line: '5457'
Line: ''
Line: '7576'
Line: '6084'
Line: '3279'
Line: '5582'
Line: '8329'
Line: '7176'
Line: '6561'
Line: '5342'
Line: '8481'
Line: '6333'
Line: ''
Line: '7617'
Line: '12916'
Line: '8957'
Line: '17210'
Line: ''
Line: '4173'
Line: '1088'
Line: '5981'
Line: '2094'
Line: '4598'
Line: '3192'
Line: '3968'
Line: '1486'
Line: '3888'
Line: '4186'
Line: '5948'
Line: '3764'
Line: '3173'
Line: '1597'
Line: '5057'
Line: ''
Line: '7430'
Line: '3183'
Line: '20030'
Line: '4003'
Line: ''
Line: '5891'
Line: '6434'
Line: '2213'
Line: '1762'
Line: '6106'
Line: '7550'
Line: '6766'
Line: '6075'
Line: '1119'
Line: '4462'
Line: ''
Line: '2460'
Line: '7385'
Line: '3906'
Line: '2805'
Line: '2519'
Line: '2189'
Line: '6803'
Line: '2705'
Line: '5167'
Line: '2972'
Line: '6855'
Line: '6996'
Line: ''
Line: '3922'
Line: '4300'
Line: '2172'
Line: '7515'
Line: '9388'
Line: '8687'
Line: '5087'
Line: '6373'
Line: '4001'
Line: ''
Line: '3288'
Line: '3888'
Line: '3873'
Line: '7575'
Line: '1902'
Line: '3315'
Line: '4831'
Line: '3272'
Line: '4914'
Line: ''
Line: '2120'
Line: '3223'
Line: '3582'
Line: '4864'
Line: '1944'
Line: '2625'
Line: '2666'
Line: '1710'
Line: '2511'
Line: '4362'
Line: '3073'
Line: '3994'
Line: '3171'
Line: ''
Line: '8037'
Line: '2890'
Line: '3124'
Line: '8901'
Line: '1411'
Line: '6858'
Line: '5184'
Line: '1294'
Line: '7790'
Line: ''
Line: '7884'
Line: '7169'
Line: '4372'
Line: '5820'
Line: '6836'
Line: '2878'
Line: '7608'
Line: '2434'
Line: '8600'
Line: '8117'
Line: ''
Line: '33732'
Line: '17277'
Line: ''
Line: '31526'
Line: '6202'
Line: ''
Line: '6081'
Line: '5669'
Line: '1460'
Line: '7548'
Line: '1054'
Line: '3713'
Line: '8470'
Line: ''
Line: '7033'
Line: '4205'
Line: '4404'
Line: '4261'
Line: '2975'
Line: '7865'
Line: '5190'
Line: '1675'
Line: '1349'
Line: '7748'
Line: ''
Line: '7345'
Line: '6389'
Line: '3056'
Line: '2777'
Line: '12209'
Line: '10038'
Line: ''
Line: '5285'
Line: '7634'
Line: '5875'
Line: '6074'
Line: '3076'
Line: '2687'
Line: '4342'
Line: '5471'
Line: '4113'
Line: ''
Line: '2993'
Line: '10714'
Line: '5204'
Line: '6732'
Line: '4746'
Line: '12416'
Line: ''
Line: '19555'
Line: '17202'
Line: '13776'
Line: '6280'
Line: ''
Line: '2820'
Line: '11278'
Line: '6160'
Line: '9522'
Line: '6585'
Line: ''
Line: '9093'
Line: '6397'
Line: '10417'
Line: '4902'
Line: '4899'
Line: ''
Line: '5602'
Line: '4917'
Line: '4964'
Line: '5689'
Line: '4316'
Line: '4041'
Line: '5290'
Line: '3223'
Line: '4065'
Line: '3514'
Line: '3552'
Line: '5864'
Line: '4823'
Line: '6481'
Line: ''
Line: '3239'
Line: '5151'
Line: '2862'
Line: '4568'
Line: '1964'
Line: '3003'
Line: '3575'
Line: '4445'
Line: '6875'
Line: '5511'
Line: '1591'
Line: '1681'
Line: '6874'
Line: ''
Line: '7348'
Line: '1881'
Line: '7702'
Line: '6305'
Line: '2373'
Line: '6320'
Line: '1544'
Line: '2897'
Line: '2784'
Line: '5977'
Line: '6964'
Line: ''
Line: '1757'
Line: '7460'
Line: '5212'
Line: '3491'
Line: '1157'
Line: '3753'
Line: '1983'
Line: '3015'
Line: '1298'
Line: '2812'
Line: '3569'
Line: '4680'
Line: ''
Line: '22481'
Line: ''
Line: '8578'
Line: '7141'
Line: '11229'
Line: '5622'
Line: '13937'
Line: '1699'
Line: ''
Line: '3479'
Line: '1258'
Line: '2782'
Line: '5573'
Line: '7720'
Line: '6726'
Line: '4043'
Line: '3059'
Line: '5028'
Line: '8075'
Line: ''
Line: '3232'
Line: '6633'
Line: '5344'
Line: '1862'
Line: '6215'
Line: '3674'
Line: '2507'
Line: '5509'
Line: '1982'
Line: '4422'
Line: '1709'
Line: ''
Line: '2759'
Line: '2497'
Line: '3959'
Line: '1725'
Line: '2430'
Line: '3256'
Line: '1416'
Line: '4213'
Line: '3452'
Line: '6809'
Line: '6817'
Line: '3151'
Line: ''
Line: '5187'
Line: '2502'
Line: '6982'
Line: '3414'
Line: '11460'
Line: '12085'
Line: '5775'
Line: ''
Line: '1490'
Line: '4368'
Line: '4135'
Line: '1494'
Line: '5683'
Line: '5443'
Line: '5182'
Line: '6209'
Line: '3240'
Line: '1433'
Line: '3373'
Line: '3048'
Line: '5768'
Line: '4132'
Line: ''
Line: '22305'
Line: '10502'
Line: ''
Line: '6633'
Line: '2336'
Line: '6714'
Line: '3046'
Line: '4740'
Line: '4650'
Line: '2901'
Line: '5832'
Line: '5690'
Line: '4211'
Line: '6168'
Line: '4901'
Line: '2448'
Line: ''
Line: '8640'
Line: '11265'
Line: '10961'
Line: '10744'
Line: '10955'
Line: ''
Line: '16404'
Line: '15126'
Line: '4253'
Line: '1372'
Line: ''
Line: '9862'
Line: '9547'
Line: '20599'
Line: ''
Line: '8872'
Line: '3452'
Line: '2169'
Line: '7757'
Line: '5535'
Line: '9697'
Line: '8147'
Line: '8775'
Line: ''
Line: '14862'
Line: ''
Line: '68282'
Line: ''
Line: '4343'
Line: '11948'
Line: '2346'
Line: '16745'
Line: ''
Line: '12892'
Line: '12538'
Line: '15571'
Line: '11814'
Line: ''
Line: '4406'
Line: '1323'
Line: '3769'
Line: '5868'
Line: '5023'
Line: '6057'
Line: '5967'
Line: '2891'
Line: '2778'
Line: '5696'
Line: '4376'
Line: '2244'
Line: '4102'
Line: '4721'
Line: ''
Line: '8420'
Line: ''
Line: '8564'
Line: '2803'
Line: '11178'
Line: '17801'
Line: ''
Line: '34616'
Line: ''
Line: '4635'
Line: '3716'
Line: '6634'
Line: '3494'
Line: '2905'
Line: '4254'
Line: '8053'
Line: '4871'
Line: '5523'
Line: '5088'
Line: '2928'
Line: ''
Line: '7447'
Line: '16669'
Line: '9215'
Line: '14663'
Line: ''
Line: '4248'
Line: '3260'
Line: '3347'
Line: '5552'
Line: '4781'
Line: '1715'
Line: '5642'
Line: '5414'
Line: '3223'
Line: '3043'
Line: '3415'
Line: '6463'
Line: '5932'
Line: ''
Line: '29980'
Line: '37187'
Line: ''
Line: '9703'
Line: '7176'
Line: '8191'
Line: '10002'
Line: '7145'
Line: '5926'
Line: '10760'
Line: '7384'
Line: ''
Line: '32599'
Line: '26889'
Line: ''
Line: '5843'
Line: '1632'
Line: '3871'
Line: '5645'
Line: '9544'
Line: '3097'
Line: '1820'
Line: ''
Line: '6941'
Line: '4838'
Line: '5440'
Line: '4389'
Line: '5309'
Line: '5449'
Line: '5897'
Line: '4418'
Line: '4641'
Line: '6905'
Line: '4951'
Line: '2198'
Line: '1031'
Line: ''
Line: '4553'
Line: '1428'
Line: '4164'
Line: '2850'
Line: '1146'
Line: '2496'
Line: '4807'
Line: '4776'
Line: '1573'
Line: '2865'
Line: '1225'
Line: '5182'
Line: '2617'
Line: '1514'
Line: '5828'
Line: ''
Line: '5660'
Line: '1567'
Line: '5066'
Line: '4985'
Line: '4683'
Line: '4819'
Line: '3894'
Line: '4432'
Line: '5188'
Line: '4791'
Line: '5916'
Line: '3867'
Line: '4285'
Line: '5863'
Line: '5570'
Line: ''
Line: '5394'
Line: '3391'
Line: '4052'
Line: '3230'
Line: '4524'
Line: '1059'
Line: '3685'
Line: '1808'
Line: '2161'
Line: '2662'
Line: '3718'
Line: '5945'
Line: '5094'
Line: '4867'
Line: '4258'
Line: ''
Line: '28646'
Line: '31561'
Line: ''
Line: '11012'
Line: '2804'
Line: '5719'
Line: '5299'
Line: '2500'
Line: '11059'
Line: ''
Line: '1318'
Line: '5060'
Line: '1097'
Line: '5290'
Line: '1059'
Line: '3435'
Line: '1082'
Line: '6242'
Line: '1623'
Line: '2004'
Line: '3567'
Line: '1725'
Line: '5056'
Line: ''
Line: '4643'
Line: '5165'
Line: '14091'
Line: '6412'
Line: '13186'
Line: ''
Line: '5560'
Line: ''
Line: '7978'
Line: '4943'
Line: '8311'
Line: '6023'
Line: '15930'
Line: ''
Line: '1972'
Line: '7310'
Line: '6563'
Line: '1748'
Line: '6142'
Line: '4529'
Line: '2106'
Line: '7066'
Line: '4598'
Line: '7301'
Line: '2132'
Line: '4005'
Line: ''
Line: '1173'
Line: '6436'
Line: '6047'
Line: '5197'
Line: '6500'
Line: '4588'
Line: '5341'
Line: '4781'
Line: '4750'
Line: '4244'
Line: '1199'
Line: '4931'
Line: '4863'
Line: '5628'
Line: ''
Line: '10302'
Line: '8627'
Line: '5405'
Line: '6570'
Line: '11439'
Line: '1447'
Line: ''
Line: '22318'
Line: '21787'
Line: '9491'
Line: ''
Line: '4710'
Line: '4259'
Line: '5894'
Line: '2971'
Line: '4273'
Line: '4994'
Line: '3414'
Line: '4179'
Line: '2483'
Line: '5404'
Line: '1646'
Line: '3099'
Line: '4035'
Line: '4066'
Line: ''
Line: '6374'
Line: '8210'
Line: '4288'
Line: '2226'
Line: '3271'
Line: '8759'
Line: '6171'
Line: '7020'
Line: '8299'
Line: '1958'
Line: ''
Line: '2744'
Line: '6690'
Line: '1431'
Line: '5118'
Line: '5387'
Line: '7128'
Line: '5517'
Line: '6299'
Line: '7515'
Line: '4304'
Line: '1846'
Line: ''
Line: '1941'
Line: '1309'
Line: '1888'
Line: '4992'
Line: '5942'
Line: '4182'
Line: '2334'
Line: '3283'
Line: '4907'
Line: '2610'
Line: '3373'
Line: '2936'
Line: '1908'
Line: ''
Line: '3400'
Line: '6953'
Line: '5233'
Line: '5348'
Line: '8743'
Line: '2799'
Line: '7890'
Line: '1898'
Line: '7783'
Line: ''
Line: '38934'
Line: ''
Line: '3843'
Line: '1038'
Line: '3364'
Line: '6113'
Line: '3952'
Line: '7192'
Line: '5767'
Line: '3932'
Line: '4462'
Line: '2088'
Line: '3925'
Line: '3990'
Line: ''
Line: '2596'
Line: '10301'
Line: '11026'
Line: '12033'
Line: '2542'
Line: '13448'
Line: ''
Line: '4798'
Line: '6076'
Line: '3906'
Line: '1617'
Line: '8462'
Line: '2051'
Line: '4827'
Line: '1905'
Line: '5940'
Line: '7175'
Line: ''
Line: '8305'
Line: '6626'
Line: '1600'
Line: '5228'
Line: '6332'
Line: '1206'
Line: '4840'
Line: '4600'
Line: '5363'
Line: ''
Line: '6425'
Line: '13475'
Line: '11305'
Line: '14037'
Line: ''
Line: '6154'
Line: '1016'
Line: '3673'
Line: '1827'
Line: '3628'
Line: '4238'
Line: '2483'
Line: '4762'
Line: '3413'
Line: '3148'
Line: '4659'
Line: '3451'
Line: '6465'
Line: '2363'
Line: ''
Line: '35242'
Line: '27022'
Line: ''
Line: '2722'
Line: '11484'
Line: '12323'
Line: '6822'
Line: '7951'
Line: '4387'
Line: ''
Line: '36866'
Line: ''
Line: '5755'
Line: '20057'
Line: '5657'
Line: ''
Line: '2491'
Line: '2205'
Line: '3527'
Line: '9556'
Line: '8363'
Line: '3109'
Line: '8618'
Line: '1481'
Line: '6234'
Line: ''
Line: '7365'
Line: '1920'
Line: '1578'
Line: '3271'
Line: '3325'
Line: '1263'
Line: '1816'
Line: '7031'
Line: '8020'
Line: '2353'
Line: '3127'
Line: ''
Line: '8027'
Line: '13092'
Line: '7531'
Line: '12350'
Line: ''
Line: '10451'
Line: '9259'
Line: '13080'
Line: '12849'
Line: ''
Line: '3984'
Line: '2140'
Line: '2655'
Line: '2766'
Line: '8665'
Line: '2282'
Line: '4391'
Line: '1435'
Line: '4821'
Line: '4977'
Line: ''
Line: '2366'
Line: ''
Line: '6198'
Line: '17922'
Line: '22945'
Line: ''
Line: '2077'
Line: '6263'
Line: '11643'
Line: '11377'
Line: '3735'
Line: '11634'
Line: '5022'
Line: ''
Line: '16598'
Line: '7968'
Line: ''
Line: '31400'
Line: '22664'
Line: ''
Line: '5414'
Line: '5057'
Line: '1898'
Line: '3063'
Line: '4075'
Line: '2527'
Line: '3502'
Line: '6713'
Line: '3109'
Line: '6376'
Line: '2487'
Line: '2279'
Line: '1057'
Line: ''
Line: '12654'
Line: '11007'
Line: '2365'
Line: '8272'
Line: '2895'
Line: ''
Line: '15798'
Line: '3536'
Line: '14549'
Line: ''
Line: '1066'
Line: '1181'
Line: '6142'
Line: '9592'
Line: '3412'
Line: '8683'
Line: ''
Line: '3274'
Line: '1129'
Line: '1645'
Line: '4784'
Line: '4039'
Line: '5447'
Line: '4766'
Line: '1310'
Line: '3346'
Line: '4062'
Line: '2219'
Line: '4290'
Line: '4733'
Line: '3033'
Line: '1306'
Line: ''
Line: '2006'
Line: '2898'
Line: '3600'
Line: '1802'
Line: '4760'
Line: '5306'
Line: '1000'
Line: '1279'
Line: '1205'
Line: '5224'
Line: '2652'
Line: '4914'
Line: '4042'
Line: '1559'
Line: ''
Line: '20342'
Line: '16632'
Line: ''
Line: '18586'
Line: '1712'
Line: '11316'
Line: '16623'
Line: ''
Line: '7964'
Line: '6856'
Line: '7863'
Line: '7417'
Line: '4608'
Line: '7216'
Line: '4263'
Line: '6552'
Line: '3187'
Line: ''
Line: '6415'
Line: '2442'
Line: '2928'
Line: '4853'
Line: '6899'
Line: '6747'
Line: '3803'
Line: '3522'
Line: '5680'
Line: '6184'
Line: '3326'
Line: '5707'
Line: '1695'
Line: ''
Line: '61737'
Line: ''
Line: '18154'
Line: '7052'
Line: ''
Line: '4635'
Line: '3560'
Line: '8043'
Line: '5917'
Line: '9440'
Line: '7535'
Line: '7213'
Line: '7625'
Line: ''
Line: '3389'
Line: '1034'
Line: '4154'
Line: '4872'
Line: '4843'
Line: '2238'
Line: '1174'
Line: '2922'
Line: '1067'
Line: '5715'
Line: '5093'
Line: '3302'
Line: '1076'
Line: '3017'
Line: '4711'
Line: ''
Line: '9322'
Line: '11596'
Line: '6347'
Line: '11332'
Line: '9376'
Line: '9230'
Line: ''
Line: '6475'
Line: '6492'
Line: '4953'
Line: '6492'
Line: '3935'
Line: '2286'
Line: '7152'
Line: '4659'
Line: '5762'
Line: '4989'
Line: '6438'
Line: '1020'
72070
#+end_example
